config/orgfiles/conf-programming.org
#+TITLE: Conf Programming
#+Last Saved: <2019-September-03 19:52:21>
#+property: header-args :tangle yes

* Conf Programming

Common configuration for programming mode.

** expand region

#+BEGIN_SRC emacs-lisp
(use-package expand-region
  :defer t
  )
#+END_SRC

** highlight-symbol

#+BEGIN_SRC emacs-lisp
(use-package highlight-symbol
  :defer 10
  :bind (("M-n" . highlight-symbol-next)
         ("M-p" . highlight-symbol-prev))
  :init
  (setq highlight-symbol-idle-delay 0.3)
  (add-hook 'prog-mode-hook 'highlight-symbol-mode)
  (highlight-symbol-nav-mode))
#+END_SRC

** rainbo-delimiters
#+BEGIN_SRC emacs-lisp

(use-package rainbow-delimiters
  :defer t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+END_SRC

** highlight-indentation

#+BEGIN_SRC emacs-lisp
(use-package highlight-indentation
  :defer t
  :config
  (set-face-background 'highlight-indentation-face "#e3e3d3")
  (set-face-background 'highlight-indentation-current-column-face "#c3b3b3")
  (add-hook 'prog-mode-hook #'highlight-indentation-mode))

#+END_SRC
** Line numbers only for programming mode

They can also toggled later on with =SPC+t+l=
To add linum to your favorite modes:
(add-hook 'org-mode-hook #'display-line-numbers-mode) ;; who needs linum in org mode!

#+BEGIN_SRC emacs-lisp
(when (version<= "26.0.50" emacs-version )
  (custom-set-faces '(line-number ((t (:inherit default :foreground "gray80")))))
  (add-hook 'prog-mode-hook #'display-line-numbers-mode))
#+END_SRC

*  Conf haskell

#+BEGIN_SRC emacs-lisp
(use-package haskell-mode :defer t)
#+END_SRC
